In [ ]:
import pandas as pd
import numpy as np

# Import module. Stronger way to import, otherwise if I use just this functions that is "stable" I can directly import it as a symbol
%load_ext autoreload
%autoreload 2
import reader_tools.GenericCSVReader as GenericCSVReader

The autoreload extension is already loaded. To reload it, use:
  %reload_ext autoreload

##### OPERATIONS IN COLUMNS

In [11]:
df = GenericCSVReader.DataframeFromCSV("StudentsPerformance.csv")
df

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [12]:
df["math score"].sum()

np.int64(66089)

In [13]:
df["math score"].mean()

np.float64(66.089)

In [14]:
df["math score"].max()

100

In [15]:
df["math score"].min()

0

In [16]:
df["math score"].std()

15.163080096009468

In [18]:
# Also with built-in python methods
max(df["math score"])

100

In [19]:
df["math score"].describe()

count    1000.00000
mean       66.08900
std        15.16308
min         0.00000
25%        57.00000
50%        66.00000
75%        77.00000
max       100.00000
Name: math score, dtype: float64

##### OPERATIONS IN ROWS

In [20]:
df["math score"] + df["reading score"]

0      144
1      159
2      185
3      104
4      154
      ...
995    187
996    117
997    130
998    146
999    163
Length: 1000, dtype: int64

In [28]:
df["avg_trial"] = (df["math score"] + df["reading score"] + df["writing score"]) / 3

In [29]:
df

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,avg_trial
0,female,group B,bachelor's degree,standard,none,72,72,74,72.666667
1,female,group C,some college,standard,completed,69,90,88,82.333333
2,female,group B,master's degree,standard,none,90,95,93,92.666667
3,male,group A,associate's degree,free/reduced,none,47,57,44,49.333333
4,male,group C,some college,standard,none,76,78,75,76.333333
...,...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95,94.000000
996,male,group C,high school,free/reduced,none,62,55,55,57.333333
997,female,group C,high school,free/reduced,completed,59,71,65,65.000000
998,female,group D,some college,standard,completed,68,78,77,74.333333
999,female,group D,some college,free/reduced,none,77,86,86,83.000000

In [27]:
df["avg_trial"].round(3)

0      72.667
1      82.333
2      92.667
3      49.333
4      76.333
        ...
995    94.000
996    57.333
997    65.000
998    74.333
999    83.000
Name: avg_trial, Length: 1000, dtype: float64

##### VALUE COUNTS: Count by category

In [30]:
df["gender"].value_counts()

gender
female    518
male      482
Name: count, dtype: int64

In [31]:
df["gender"].value_counts(normalize=True)

gender
female    0.518
male      0.482
Name: proportion, dtype: float64

In [33]:
df["parental level of education"].value_counts(normalize=True)

parental level of education
some college          0.226
associate's degree    0.222
high school           0.196
some high school      0.179
bachelor's degree     0.118
master's degree       0.059
Name: proportion, dtype: float64

##### SORT A DATAFRAME

In [34]:
df.sort_values(by="math score")

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,avg_trial
59,female,group C,some high school,free/reduced,none,0,17,10,9.000000
980,female,group B,high school,free/reduced,none,8,24,23,18.333333
17,female,group B,some high school,free/reduced,none,18,32,28,26.000000
787,female,group B,some college,standard,none,19,38,32,29.666667
145,female,group C,some college,free/reduced,none,22,39,33,31.333333
...,...,...,...,...,...,...,...,...,...
625,male,group D,some college,standard,completed,100,97,99,98.666667
623,male,group A,some college,standard,completed,100,96,86,94.000000
451,female,group E,some college,standard,none,100,92,97,96.333333
962,female,group E,associate's degree,standard,none,100,100,100,100.000000
149,male,group E,associate's degree,free/reduced,completed,100,100,93,97.666667

In [35]:
df.sort_values(by="math score", ascending=False)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,avg_trial
962,female,group E,associate's degree,standard,none,100,100,100,100.000000
625,male,group D,some college,standard,completed,100,97,99,98.666667
458,female,group E,bachelor's degree,standard,none,100,100,100,100.000000
623,male,group A,some college,standard,completed,100,96,86,94.000000
451,female,group E,some college,standard,none,100,92,97,96.333333
...,...,...,...,...,...,...,...,...,...
145,female,group C,some college,free/reduced,none,22,39,33,31.333333
787,female,group B,some college,standard,none,19,38,32,29.666667
17,female,group B,some high school,free/reduced,none,18,32,28,26.000000
980,female,group B,high school,free/reduced,none,8,24,23,18.333333
59,female,group C,some high school,free/reduced,none,0,17,10,9.000000

In [37]:
df.sort_values(by=["math score", "reading score"])

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,avg_trial
59,female,group C,some high school,free/reduced,none,0,17,10,9.000000
980,female,group B,high school,free/reduced,none,8,24,23,18.333333
17,female,group B,some high school,free/reduced,none,18,32,28,26.000000
787,female,group B,some college,standard,none,19,38,32,29.666667
145,female,group C,some college,free/reduced,none,22,39,33,31.333333
...,...,...,...,...,...,...,...,...,...
625,male,group D,some college,standard,completed,100,97,99,98.666667
149,male,group E,associate's degree,free/reduced,completed,100,100,93,97.666667
458,female,group E,bachelor's degree,standard,none,100,100,100,100.000000
916,male,group E,bachelor's degree,standard,completed,100,100,100,100.000000
962,female,group E,associate's degree,standard,none,100,100,100,100.000000

In [38]:
# The original dataframe doesn't change
df

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,avg_trial
0,female,group B,bachelor's degree,standard,none,72,72,74,72.666667
1,female,group C,some college,standard,completed,69,90,88,82.333333
2,female,group B,master's degree,standard,none,90,95,93,92.666667
3,male,group A,associate's degree,free/reduced,none,47,57,44,49.333333
4,male,group C,some college,standard,none,76,78,75,76.333333
...,...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95,94.000000
996,male,group C,high school,free/reduced,none,62,55,55,57.333333
997,female,group C,high school,free/reduced,completed,59,71,65,65.000000
998,female,group D,some college,standard,completed,68,78,77,74.333333
999,female,group D,some college,free/reduced,none,77,86,86,83.000000

In [39]:
df.sort_values(by=["math score", "reading score"], inplace=True)

In [40]:
df

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,avg_trial
59,female,group C,some high school,free/reduced,none,0,17,10,9.000000
980,female,group B,high school,free/reduced,none,8,24,23,18.333333
17,female,group B,some high school,free/reduced,none,18,32,28,26.000000
787,female,group B,some college,standard,none,19,38,32,29.666667
145,female,group C,some college,free/reduced,none,22,39,33,31.333333
...,...,...,...,...,...,...,...,...,...
625,male,group D,some college,standard,completed,100,97,99,98.666667
149,male,group E,associate's degree,free/reduced,completed,100,100,93,97.666667
458,female,group E,bachelor's degree,standard,none,100,100,100,100.000000
916,male,group E,bachelor's degree,standard,completed,100,100,100,100.000000
962,female,group E,associate's degree,standard,none,100,100,100,100.000000

###### SORTING WITH TEXT

In [42]:
df.sort_values("race/ethnicity", key=lambda col:col.str.lower())

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,avg_trial
464,male,group A,bachelor's degree,standard,completed,75,58,62,65.000000
378,female,group A,some high school,standard,none,71,83,77,77.000000
769,male,group A,some college,free/reduced,none,58,60,57,58.333333
589,female,group A,some high school,standard,none,48,66,65,59.666667
88,female,group A,some college,standard,none,58,70,67,65.000000
...,...,...,...,...,...,...,...,...,...
884,female,group E,associate's degree,standard,none,51,51,54,52.000000
700,female,group E,bachelor's degree,standard,completed,79,81,82,80.666667
533,female,group E,associate's degree,standard,completed,79,88,94,87.000000
50,male,group E,some college,standard,none,53,55,48,52.000000
962,female,group E,associate's degree,standard,none,100,100,100,100.000000